---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewReferencingDetail
source: html/f7f9de8e-c640-f5e6-750e-07cbc5c1cbb4.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewReferencingDetail Property

"Referencing Detail"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewReferencingDetail { get; }
```